import { Yogi } from '../types';

export const NUMS = {
  maxDegree: 30,
  maxMinute: 60,
  fullDegree: 360,
  fullDegreeAsMin: 21600,
  nakshatraMin: 800,
  monthAsMinutes: 1800,
  monthDegree: 30,
};

export const MONTHS = [
  {
    name: 'حمل',
    value: 1,
  },
  {
    name: 'ثور',
    value: 2,
  },
  {
    name: 'جوزا',
    value: 3,
  },
  {
    name: 'سرطان',
    value: 4,
  },
  {
    name: 'اسد',
    value: 5,
  },
  {
    name: 'سنبله',
    value: 6,
  },
  {
    name: 'میزان',
    value: 7,
  },
  {
    name: 'عقرب',
    value: 8,
  },
  {
    name: 'قوس',
    value: 9,
  },
  {
    name: 'جدی',
    value: 10,
  },
  {
    name: 'دلو',
    value: 11,
  },
  {
    name: 'حوت',
    value: 12,
  },
];

export const dayNight = [{ value: 'روز' }, { value: 'شب' }];

export const yogis: Yogi[] = [
  {
    name: 'ویشکومبا (تقویت)',
    nak: 'پوشیا',
    yPlanet: 'زحل',
    ayPlanet: 'ماه',
    desription: `غلبه بر دیگران و پیروزی بر دشمنان و کسب دارایی و ثروتمندی. ممکن است دارای بهترین ویژگی ها و خوش شانسی باشند. آنها معمولا بسیار زیبا و باهوش هستند. آنها از آنجایی که از نظر مالی در امان هستند نیازی به مشکل مالی ندارند.
    یوگای تولد آنها به یک زندگی خانوادگی شاد کمک می کند. نه تنها این، بومیان به راحتی می توانند با شخصیت خود بر افراد تأثیر بگذارند و یک حلقه اجتماعی بزرگ داشته باشند. ویشکومبا بومیان را بسیار باهوش می کند.`,
  },
  {
    name: 'پریتی (علاقه)',
    nak: 'آشلشا',
    yPlanet: 'عطارد',
    ayPlanet: 'مریخ',
    desription:
      'خوش قیافه و جذب جنس مخالف شدن و لذت بردن از زندگی با خرسندی و رضایت. بومیان آن سرزنده، کنجکاو و با روحیه ورزشی کار خواهند کرد. آنها زیبایی پرست هستند. پریتی در آنها تمایل به جنس مخالف ایجاد می کند و رابطه خوبی با آنها برقرار می کند. آنها باهوش هستند و می دانند چگونه در زندگی به موفقیت برسند.',
  },
  {
    name: 'آیوشمان (طول عمر)',
    nak: 'ماگها',
    yPlanet: 'کیتو',
    ayPlanet: 'راهو',
    desription: `سلامتی و طول عمر و فعال و پر انرژی.
    شخص عمر طولانی خواهد داشت به این معنی که در مقایسه با دیگران مدت طولانی تری طعم خوشبختی زندگی را خواهد چشید. آنها به شعر و موسیقی علاقه زیادی دارند. آنها با ثروت به دنیا می آیند و مشکل مالی ندارند. آنها از نظر بدنی قوی هستند و در نبرد توانایی شکست دادن دشمنان را دارند.`,
  },
  {
    name: 'سایوبهاگیا (خوش شانسی)',
    nak: 'پوروا فالگونی',
    yPlanet: 'زهره',
    ayPlanet: 'مشتری',
    desription: `بهرمندی از یک زندگی سرشار از عشق و شانس و خوشحالی.
    شخص ثروت شگفت انگیزی به دست می آورند. مردم ویژگی های آنها را تحسین می کنند زیرا استعدادهای ذاتی مختلفی در آنها وجود دارد. سایوبهاگیا تمایل به جذب جنس مخالف را ایجاد می کند و ممکن است افراد زیبا را غیرقابل مقاومت بدانند`,
  },
  {
    name: 'شبهانا (شکوه و جلال)',
    nak: 'اوتارافالگونی',
    yPlanet: 'خورشید',
    ayPlanet: 'زحل',
    desription: `بدنی درخشان و رفتاری چشمگیر و شهوت بالا و حریص در سکس.
    شخص زیبا و جذاب است. او در انجام کارها بسیار محتاط است و آنها را تقریباً بی نقص انجام می دهد. همسر او بسیار جذاب و دارای ویژگی های خوب خواهد بود. این یوگای فرخنده باعث رضایتمندی کودکان بومی خواهد شد. فرد ممکن است کمی پرخاشگر باشد.`,
  },
  {
    name: 'آتیگاندا (گونه بزرگ)',
    nak: 'هاستا',
    yPlanet: 'ماه',
    ayPlanet: 'عطارد',
    desription: `زندگی دشوار ناشی از موانع و حوادث بیشمار و کینه توز و عصبی.
    شخص ممکن است مشکلاتی را برای مادرش ایجاد کند. او دارای خلق و خویی است که برای خانواده اش چندان مناسب نیست. شاید خانواده او به این دلیل مشکلات زیادی را متحمل شوند`,
  },
  {
    name: 'سوکارما (پرهیزکار)',
    nak: 'چیترا',
    yPlanet: 'مریخ',
    ayPlanet: 'کیتو',
    desription: `انجام کردار نجیب و بلند نظر و مهربان و ثروتمند.
    شخص به کارهای مذهبی اعتقاد دارند. آنها کارگران بسیار خوبی هستند و طبیعتی شایسته و ساده دارند. سوکارما آنها را نسبت به مردم دلسوز و دلسوز می کند. مردم معمولاً آنها را به خاطر ویژگی های رفتاری و مهربانی شان دوست دارند. سوکارما ثروت بزرگی به فرد می دهد.`,
  },
  {
    name: 'دریتی یوگا (عزم)',
    nak: 'سواتی',
    yPlanet: ' راهو',
    ayPlanet: 'زهره',
    desription: `بهرمندی از ثروت و اموال و همسر و حمایت از جانب دیگران و زیاده روی در مهمان نوازی از دیگران.
    شخص بسیار صبور است. آنها به سرعت هیجان زده نمی شود و تصمیمات خود را تنها پس از تفکر طولانی و سخت می گیرد. دریتی به آنها سلامتی سالم می بخشد. به طور معمول افراد دریتی با استعداد و عاقل هستند. آنها زندگی خانوادگی آرامی دارند و در جامعه به موفقیت می رسند`,
  },
  {
    name: 'شولا (نیزه - درد)',
    nak: 'ویشاگها',
    yPlanet: 'مشتری',
    ayPlanet: 'ماه',
    desription: `رویارویی و مخالفت با دیگران و ستیزه جو و عصبی.
    شخص طبیعت مذهبی دارد. او به متون دینی علاقه مند خواهد شد. او ممکن است دانش زیادی در مورد چیزهای مذهبی کسب کند، اما میل مادی نیز در او وجود دارد، زیرا شولا او را در جمع آوری ثروت نیز خوب می کند. اگرچه شولا ویژگی‌های خوب و لحظات شادی را به ارمغان می‌آورد، اما بخش بدی نیز دارد زیرا شخص ممکن است زندگی ناخوشایندی داشته باشد.`,
  },
  {
    name: 'گاندا (گونه)',
    nak: 'آنورادها',
    yPlanet: 'زحل',
    ayPlanet: 'ماه',
    desription: `خدشه اخلاقیات و رفتار و مشکلات شخصیتی.
    شخص ممکن است زندگی مشکل زا داشته باشند. آنها ممکن است بیش از حد نگران سلامتی خود باشند و ممکن است مجبور شوند در زندگی خود با برخی مشکلات سلامتی واقعی روبرو شوند. شخص دارای قد کوتاه با سر بزرگ هست. آنها از نظر بدنی بسیار قوی هستند و دوست دارند در فعالیت های مجلل افراط کنند.`,
  },
  {
    name: 'وریدهی (ترقی)',
    nak: 'جیشتا',
    yPlanet: 'عطارد',
    ayPlanet: 'ماه',
    desription:
      'شخص باهوش و فرصت طلب و فهمیده و زندگی بطور پیوسته و مستمر که با زیاد شدن سن بهتر میشود. شخص دارای هیکل و طبیعت جذابی هست. وریدهی باعث رفاه می شود و برخی از ویژگی های شخصیتی خوب را در طبیعت بومی به ارمغان می آورد. تأثیر وریدهی فقط به بومی ها محدود نمی شود، بلکه در شخصیت همسر و پسرش نیز دیده می شود زیرا نگرش خوبی خواهند داشت.',
  },
  {
    name: 'درووا (استوار)',
    nak: 'مولا',
    yPlanet: 'کیتو',
    ayPlanet: 'راهو',
    desription:
      'شخصیت ثابت و توانایی در تمرکز و پافشاری و ثروتمند. شخص طبیعت آرامی دارد. او در هر کاری که انجام می دهند بسیار متمرکز است. درووا قدرت بدنی همراه با یک زندگی مرفه می دهد. شخص تقریباً از هر حوزه ای از جامعه به خاطر طبیعت متشکل خود عشق می ورزد و دارای برکت عمر طولانی است.',
  },
  {
    name: 'ویاگاتا (کوبیدن) ',
    nak: 'پوروا آشادها',
    yPlanet: 'زهره',
    ayPlanet: 'مشتری',
    desription: `بی رحم و در فکر آزار رساندن به دیگران.
    او در انجام کارهای مختلف مهارت دارد. مهارت آنها در فعالیت های متعدد در جامعه قابل تقدیر است. آنها افراد بسیار با استعداد و ماهری هستند. به دلیل این ویژگی ها در شخصیت خود مشهور می شوند و در زندگی خود به موفقیت می رسند.`,
  },
  {
    name: 'هارشانا (لرزه)',
    nak: 'اوتاراآشادها',
    yPlanet: 'خورشید',
    ayPlanet: 'زحل',
    desription: `باهوش و نشاط و شادی و خوشمزگی.
    شخص بسیار خوش شانس هست. هارشانا آنها را در موضوعات مختلف شایسته و دانشمند می کند. آنها مصمم هستند و قدرت ایستادن بر اعتقادات خود را دارند. آنها به خاطر این ویژگی ها در جامعه مورد احترام هستند.`,
  },
  {
    name: 'واجرا (الماس - آذرخش)',
    nak: 'شراوانا',
    yPlanet: 'ماه',
    ayPlanet: 'عطارد',
    desription: `ثروتمند و شهوت پرست و دمدمی و با قدرت.
    واجرا قدرت فوق العاده ای به شخص به ویژه به دست ها می دهد. قدرت بدنی و استقامتی که از واجرا به دست می آید، شخص را در تلاش های بدنی بسیار ماهر می کند. آنها در کار با سلاح نیز متخصص هستند. معمولاً آنها مجبور نیستند با بحران مالی روبرو شوند. واجرا شخص را بسیار شجاع و قوی می کند.`,
  },
  {
    name: 'سیدی (موفقیت)',
    nak: 'دهانیشتا',
    yPlanet: 'مریخ',
    ayPlanet: 'کیتو',
    desription: `ماهر و فاضل در چندین زمینه و حامی و محافظ دیگران.
    او در هر شغلی مهارت خواهد داشت. او طبیعتی فداکار و توجه دارد و معمولاً قادر است تقریباً همه چیز را با مهارت یکسان انجام دهد. آنها افراد زیبایی هستند و زندگی شادی دارند. طبیعت دلسوز آنها را وادار می کند که به افراد معلول و فقیر کمک و کمک کنند. این یوگا می تواند باعث مشکلات سلامتی شود.`,
  },
  {
    name: 'ویاتیپادا (بیچارگی)',
    nak: 'شاتابیشاک',
    yPlanet: 'راهو',
    ayPlanet: 'زهره',
    desription: `مستعد وقایع ناگوار و واژگونی و بی ثبات و غیر قابل اعتماد.
    شخص دوران کودکی بسیار مشکلی را تجربه می کنند. در روزهای شکل گیری زندگی خود با مشکلات زیادی روبرو هست. به تدریج تجارب آنها از زندگی کیفیت منحصر به فردی را در تبدیل غم به شادی ایجاد می کند. آنها در دوران جوانی شروع به دریافت شادی و لحظات شادی می کنند و در نهایت در زندگی به موفقیت می رسند.`,
  },
  {
    name: 'واریانا (آسایش)',
    nak: 'پوروا بهادرا',
    yPlanet: 'مشتری',
    ayPlanet: 'خورشید',
    desription: `عاشق رفاه و تجملات و تنبل و شهوانی.
    شخص در موسیقی، رقص و سایر هنرها بسیار خوب هست. اگر در این زمینه ها شغلی داشته باشند، می توانند به موفقیت سریع دست یابند. علاقه شخص به رشته های خلاقانه و اشتیاق به اجرا در آنها از تخصص واریانا است. آنها بسیار مصمم هستند و تنها پس از رسیدن به هدفشان استراحت می کنند. واریانا آنها را به افراد قوی و قدرتمند تبدیل می کند.`,
  },
  {
    name: 'پاریگا (انسداد)',
    nak: 'اوتارابادرا',
    yPlanet: 'مشتری',
    ayPlanet: 'خورشید',
    desription: `جهت پیشرفت در زندگی با موانع بسیاری مواجه میشود و کج خلق و فضول.
    شخص باهوش هست و در بسیاری از موضوعات دانش دارد. ورودی های پاریگا را می توان در شخصیت آنها مشاهده کرد زیرا آنها بسیار با استعداد و عاقل هستند. آنها با دانش متنوع خود مشهور می شوند و برای خود و خانواده خود افتخار کسب می کنند. آنها مردمی نرم هستند و از ثمرات زندگی خانوادگی لذت می برند.`,
  },
  {
    name: 'شیوا (سعد)',
    nak: 'رواتی',
    yPlanet: 'عطارد',
    ayPlanet: 'مریخ',
    desription: `مورد احترام افراد عالیرتبه و دولت و آرام و دانا و متدین و ثروتمند
    شخص بسیار باهوش و برای رفاه مردم کار می کند. او بالاتر از هر خواسته مادی هست و فداکارانه خود را وقف مشکلات دیگران می کند. او قلب واقعی دارد و خرد ذاتی در شخصیتش باعث احترام جامعه می شود.`,
  },
  {
    name: 'سیدا (فاضل)',
    nak: 'آشوینی',
    yPlanet: 'کیتو',
    ayPlanet: 'راهو',
    desription: `از نظر شخصیتی اصلاح شده و دارای طبیعت خوش مشرب و علاقمند به تشریفات مذهبی و مسائل معنوی.
    علاقه زیادی برای اجرای تانترا-مانترا دارند. آنها همسری جذاب و باهوش دارند و دارای ثروت کافی برای زندگی راحت خواهند بود.`,
  },
  {
    name: 'سادهیا (تابع)',
    nak: 'بارانی',
    yPlanet: 'زهره',
    ayPlanet: 'مشتری',
    desription: `شخصیت بومی را مصمم و با اعتماد به نفس می کند. صبر و شکیبایی ویژگی خاصی در آنهاست و بدون نگرانی منتظر نتیجه زحمات خود هستند. آنها در یک لحظه اقدام نمی کنند و فقط تصمیمات سنجیده می گیرند.`,
  },
  {
    name: 'شوبا (سعد)',
    nak: 'کریتیکا',
    yPlanet: 'خورشید',
    ayPlanet: 'زحل',
    desription: `جسم و شخصیت شفاف و متمایز و دارای مشکلاتی در سلامتی و ثروتمند.
    شخص بسیار زیبا، باهوش و با استعداد هست. ثروت فراوانی دارد و هرگز در طول زندگی با مشکل مالی مواجه نمی شود. او اهداکننده بسیار سخاوتمندی هست و عمیقاً به افراد عالم و مذهبی احترام می گذارد.`,
  },
  {
    name: 'شوکلا (سفید روشن)',
    nak: 'روهینی',
    yPlanet: ' ماه ',
    ayPlanet: 'عطارد',
    desription: `پر حرف و دمدمی مزاج و ناآرام و بی قرار و ناشکیبا و دارای فکر و ذهن متغیر و ناپایدار.
    او تقریباً در هر نوع هنری متخصص هست. خیلی به شعر علاقه دارند و ممکن است خودشان شاعر شوند. آنها افراد بسیار تحصیل کرده ای هستند و روح شجاعی دارند. شوکلا به آنها امنیت مالی می دهد. آنها با شخصیت درخشان خود بر قلب مردم حکومت می کنند.`,
  },
  {
    name: 'براهما (روحانی - خدا)',
    nak: ' مریگاشیرا',
    yPlanet: 'مریخ',
    ayPlanet: 'کیتو',
    desription: `معتمد و رازدار و بلند همت و دارای قضاوت و تشخیص خوب.
    براهما بسیار خوش یمن است. آنها از وداها دانش کسب می کنند. علاوه بر این آنها در موضوعات دیگر نیز بسیار مسلط هستند. آنها ایمان عمیقی به خدا دارند و قلبی پرهیزگار دارند.`,
  },
  {
    name: 'ایندرا (پشیرو) ',
    nak: 'آردرا',
    yPlanet: 'راهو',
    ayPlanet: 'زهره',
    desription: `علاقمند به تحصیلات و علم و کمک کننده و ثروتمند.
    شخص ثروت خوبی دارد. این افراد بسیار ثروتمند هستند و برخی از بهترین ویژگی های شخصیتی را دارند. آنها از زندگی خانوادگی خود نهایت لذت را می برند. اما ایندرا جنبه بدی دارد زیرا ممکن است طول عمر بومی را محدود کند`,
  },
  {
    name: 'وایدریتی (کم تحمل)',
    nak: 'پونارواسو',
    yPlanet: 'مشتری',
    ayPlanet: 'خورشید',
    desription: `انتقادی و دارای طبیعت طرح ریزی و قدرتمند و درهم شکننده هم از لحاظ ذهنی و هم از لحاظ جسمی.
    وایدریتی به شخص خود نشاط و انرژی مثبت می دهد. او وظایف محوله را با روحیه ای ورزشی انجام می دهد. طبیعت او ویژگی های خوبی دارد، به عنوان مثال، او فردی بسیار پر زحمت و تواناست. وایدریتی فرد را بسیار مفید و سخاوتمند می کند، اما ممکن است اعتباری را که شایسته آن است دریافت نکند.`,
  },
];
